## Plan for terraform
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 0 to change, 2 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecrpublic_repository.aws-sentinel-connector-layer will be created
  + resource "aws_ecrpublic_repository" "aws-sentinel-connector-layer" {
      + arn             = (known after apply)
      + force_destroy   = false
      + id              = (known after apply)
      + registry_id     = (known after apply)
      + repository_name = "aws-sentinel-connector"
      + repository_uri  = (known after apply)
      + tags            = {
          + "CostCentre" = "aws-sentinel-connection-layer"
          + "Terraform"  = "true"
        }
      + tags_all        = {
          + "CostCentre" = "aws-sentinel-connection-layer"
          + "Terraform"  = "true"
        }

      + catalog_data {
          + description     = "repo for the aws-sentinel-connector artifact"
          + logo_image_blob = (known after apply)
        }
    }

  # aws_lambda_layer_version.lambda_layer must be replaced
-/+ resource "aws_lambda_layer_version" "lambda_layer" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:13" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2022-10-17T18:23:22.664+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:13" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "HHmn4YMuj2fVEGOXUbSc2TAJqMSEqzxTsXqLAszuQi4=" -> "j5dN2lEuGtkoClbxZJ6wROT8FZ5mdSCQ5gZGOVbxUKk=" # forces replacement
      ~ source_code_size            = 10327911 -> (known after apply)
      ~ version                     = "13" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_layer_version_permission.lambda_layer_permission must be replaced
-/+ resource "aws_lambda_layer_version_permission" "lambda_layer_permission" {
      ~ id             = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer,13" -> (known after apply)
      ~ layer_name     = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer" -> (known after apply) # forces replacement
      ~ policy         = jsonencode(
            {
              - Id        = "default"
              - Statement = [
                  - {
                      - Action    = "lambda:GetLayerVersion"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:lambda:ca-central-1:283582579564:layer:aws-sentinel-connector-layer:13"
                      - Sid       = "shared-layer-permission"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ revision_id    = "d03d5265-74c3-413e-9160-3990430dc581" -> (known after apply)
      ~ version_number = 13 -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.attach_tf_plan_policy.aws_iam_policy.this"]

18 tests, 17 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
